abnormalvis/Mspm0g3507_competition_template/MSPM0G3507_Project_template/ncontroller.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @versions {"tool":"1.21.1+3772"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const GPIO10        = GPIO.addInstance();
const GPIO11        = GPIO.addInstance();
const GPIO12        = GPIO.addInstance();
const GPIO13        = GPIO.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1          = SPI.addInstance();
const SPI2          = SPI.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const TIMER2        = TIMER.addInstance();
const TIMER3        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const divider5       = system.clockTree["PLL_CLK1_DIV"];
divider5.divideValue = 4;

const divider6       = system.clockTree["PLL_CLK2X_DIV"];
divider6.divideValue = 4;

const divider7       = system.clockTree["PLL_PDIV"];
divider7.divideValue = 2;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const gate7  = system.clockTree["MFCLKGATE"];
gate7.enable = true;

const gate8  = system.clockTree["MFPCLKGATE"];
gate8.enable = true;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 10;

const mux2       = system.clockTree["CANCLKMUX"];
mux2.inputSelect = "CANCLKMUX_PLLCLK1_OUT";

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL2X";

ADC121.$name                      = "ADC12_0";
ADC121.sampClkDiv                 = "DL_ADC12_CLOCK_DIVIDE_8";
ADC121.repeatMode                 = true;
ADC121.peripheral.adcPin0.$assign = "PA27";
ADC121.adcPin0Config.$name        = "ti_driverlib_gpio_GPIOPinGeneric15";

const Board                       = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

GPIO1.$name                                       = "PORTB";
GPIO1.associatedPins.create(4);
GPIO1.associatedPins[0].$name                     = "RST";
GPIO1.associatedPins[0].pin.$assign               = "PB10";
GPIO1.associatedPins[1].$name                     = "DC";
GPIO1.associatedPins[1].pin.$assign               = "PB11";
GPIO1.associatedPins[2].$name                     = "CS";
GPIO1.associatedPins[2].pin.$assignAllowConflicts = "PB14";
GPIO1.associatedPins[3].$name                     = "BLK";
GPIO1.associatedPins[3].assignedPort              = "PORTB";
GPIO1.associatedPins[3].assignedPin               = "26";

GPIO2.$name                              = "GPIO_Key_up";
GPIO2.port                               = "PORTB";
GPIO2.associatedPins[0].$name            = "PIN_13";
GPIO2.associatedPins[0].direction        = "INPUT";
GPIO2.associatedPins[0].assignedPin      = "13";
GPIO2.associatedPins[0].internalResistor = "PULL_UP";

GPIO3.$name                              = "GPIO_Key_down";
GPIO3.port                               = "PORTB";
GPIO3.associatedPins[0].$name            = "PIN_19";
GPIO3.associatedPins[0].direction        = "INPUT";
GPIO3.associatedPins[0].internalResistor = "PULL_UP";
GPIO3.associatedPins[0].assignedPin      = "19";

GPIO4.$name                              = "GPIO_Key_left";
GPIO4.port                               = "PORTB";
GPIO4.associatedPins[0].direction        = "INPUT";
GPIO4.associatedPins[0].internalResistor = "PULL_UP";
GPIO4.associatedPins[0].$name            = "PIN_23";
GPIO4.associatedPins[0].assignedPin      = "23";

GPIO5.$name                              = "GPIO_Key_right";
GPIO5.port                               = "PORTB";
GPIO5.associatedPins[0].$name            = "PIN_18";
GPIO5.associatedPins[0].direction        = "INPUT";
GPIO5.associatedPins[0].assignedPin      = "18";
GPIO5.associatedPins[0].internalResistor = "PULL_UP";

GPIO6.$name                              = "GPIO_Key_medium";
GPIO6.port                               = "PORTB";
GPIO6.associatedPins[0].$name            = "PIN_24";
GPIO6.associatedPins[0].direction        = "INPUT";
GPIO6.associatedPins[0].assignedPin      = "24";
GPIO6.associatedPins[0].internalResistor = "PULL_UP";

GPIO7.$name                          = "Encoder";
GPIO7.associatedPins.create(6);
GPIO7.associatedPins[0].direction    = "INPUT";
GPIO7.associatedPins[0].assignedPin  = "29";
GPIO7.associatedPins[0].interruptEn  = true;
GPIO7.associatedPins[0].assignedPort = "PORTA";
GPIO7.associatedPins[0].$name        = "E2A";
GPIO7.associatedPins[0].polarity     = "RISE";
GPIO7.associatedPins[1].assignedPin  = "30";
GPIO7.associatedPins[1].direction    = "INPUT";
GPIO7.associatedPins[1].interruptEn  = true;
GPIO7.associatedPins[1].assignedPort = "PORTA";
GPIO7.associatedPins[1].$name        = "E2B";
GPIO7.associatedPins[1].polarity     = "RISE";
GPIO7.associatedPins[2].assignedPin  = "5";
GPIO7.associatedPins[2].direction    = "INPUT";
GPIO7.associatedPins[2].interruptEn  = true;
GPIO7.associatedPins[2].assignedPort = "PORTB";
GPIO7.associatedPins[2].$name        = "E1B";
GPIO7.associatedPins[2].polarity     = "RISE";
GPIO7.associatedPins[3].assignedPin  = "6";
GPIO7.associatedPins[3].direction    = "INPUT";
GPIO7.associatedPins[3].interruptEn  = true;
GPIO7.associatedPins[3].assignedPort = "PORTB";
GPIO7.associatedPins[3].$name        = "E1A";
GPIO7.associatedPins[3].polarity     = "RISE";
GPIO7.associatedPins[4].$name        = "IMU_INT1";
GPIO7.associatedPins[4].assignedPort = "PORTB";
GPIO7.associatedPins[4].assignedPin  = "7";
GPIO7.associatedPins[5].$name        = "IMU_INT2";
GPIO7.associatedPins[5].assignedPort = "PORTB";
GPIO7.associatedPins[5].assignedPin  = "4";

GPIO8.port                          = "PORTA";
GPIO8.$name                         = "Motor_diection";
GPIO8.associatedPins.create(4);
GPIO8.associatedPins[0].ioStructure = "SD";
GPIO8.associatedPins[0].$name       = "BIN1";
GPIO8.associatedPins[0].assignedPin = "26";
GPIO8.associatedPins[1].ioStructure = "SD";
GPIO8.associatedPins[1].$name       = "AIN1";
GPIO8.associatedPins[1].assignedPin = "24";
GPIO8.associatedPins[2].ioStructure = "SD";
GPIO8.associatedPins[2].$name       = "AIN2";
GPIO8.associatedPins[2].assignedPin = "25";
GPIO8.associatedPins[3].assignedPin = "22";
GPIO8.associatedPins[3].ioStructure = "SD";
GPIO8.associatedPins[3].$name       = "BIN2";

GPIO9.port                           = "PORTA";
GPIO9.$name                          = "GPIO";
GPIO9.associatedPins.create(2);
GPIO9.associatedPins[0].initialValue = "SET";
GPIO9.associatedPins[0].ioStructure  = "OD";
GPIO9.associatedPins[0].assignedPin  = "0";
GPIO9.associatedPins[0].$name        = "SCL";
GPIO9.associatedPins[0].pin.$assign  = "PA0";
GPIO9.associatedPins[1].initialValue = "SET";
GPIO9.associatedPins[1].ioStructure  = "OD";
GPIO9.associatedPins[1].assignedPin  = "1";
GPIO9.associatedPins[1].$name        = "SDA";

GPIO10.$name                              = "Tracking";
GPIO10.associatedPins.create(3);
GPIO10.associatedPins[0].assignedPort     = "PORTA";
GPIO10.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO10.associatedPins[0].assignedPin      = "15";
GPIO10.associatedPins[0].$name            = "SO";
GPIO10.associatedPins[1].internalResistor = "PULL_DOWN";
GPIO10.associatedPins[1].assignedPort     = "PORTA";
GPIO10.associatedPins[1].assignedPin      = "28";
GPIO10.associatedPins[1].$name            = "S1";
GPIO10.associatedPins[2].internalResistor = "PULL_DOWN";
GPIO10.associatedPins[2].assignedPort     = "PORTB";
GPIO10.associatedPins[2].assignedPin      = "21";
GPIO10.associatedPins[2].$name            = "S2";

GPIO11.$name                          = "SPI_FOR_IMU_CS";
GPIO11.port                           = "PORTA";
GPIO11.associatedPins[0].$name        = "PIN_8";
GPIO11.associatedPins[0].initialValue = "SET";
GPIO11.associatedPins[0].ioStructure  = "SD";
GPIO11.associatedPins[0].assignedPin  = "8";

GPIO12.$name                          = "GPIO_BEEP";
GPIO12.associatedPins[0].$name        = "PIN_0";
GPIO12.associatedPins[0].assignedPort = "PORTB";
GPIO12.associatedPins[0].assignedPin  = "12";

